/* "Alert body when trying to download a file and it is not in the right format" */
"alert.message.notValidData" = "No se puede analizar la respuesta de JSON";

/* If something went wrong, but the writing was generally successful */
" However, there was an error writing one or more of the files" = " Aunque ha habido un error al escribir en uno o más archivos.";

/* Actionsheet message for stating that nothing was generated  */
"An error has occurred and no files have been generated." = "Ha ocurrido un error y no se ha generado ningún archivo.";

/* Title of an alert if there is an error getting content of a url */
"An Error Occurred" = "Ha ocurrido un error";

/* The title for the action sheet saying something went wrong */
"An error occurred while verifying the JSON" = "Ha ocurrido un error al verificar JSON";

/* Cancel button in the overwrite files prompt */
"Cancel" = "Cancelar";

/* Label to have the user select which folder to choose */
"Choose" = "Elegir";

/* Button to dismiss an action sheet */
"OK" = "OK";

/* Prompt user gets to enter a URL */
"Enter URL..." = "Introducir URL...";

/* No comment provided by engineer. */
"Expected content type %@, got %@" = "Tipo de contenido esperado: %1$@. Obtenido: %2$@";

/* No comment provided by engineer. */
"Expected status code %@, got %d" = "Código de estado esperado: %1$@. Obtenido: %2$d";

/* Toolbar item name for General Preferences */
"General" = "General";

/* In the main screen, this is the button that writes out files */
"Generate Files" = "Generar archivos";

/* In the main screen, this is the button that fetches data from a URL */
"Get Data" = "Obtener datos";

/* Error message to state the JSON didn't start with a {} or [] */
"JSON text did not start with array or object." = "El texto JSON no empieza con indicador de array u objeto.";

/* Message when writing the files, nothing was written */
"No file were written to the disk" = "No se ha escrito ningún archivo en el disco.";

/* This is the current title of http options window that gets written */
"Options" = "Opciones";

/* In the save portion, the label to choose what language */
"Output Language" = "Lenguaje de destino";

/* Button text to overwrite files */
"Overwrite Files" = "Sobrescribir archivos";

/* The title of the prompt to tell the user they are about to overwrite the files in the existing application */
"Overwrite files?" = "¿Sobrescribir los archivos?";

/* In the save portion, the label to choose what the package is */
"Package Name" = "Nombre del paquete";

/* In the save portion, the prompt to specify what the base class is */
"Base Class" = "Clase base";

/* Message in an actionsheet stating that the write is successful */
"Success!" = "Satisfactorio!";

/* If there is nothing in the JSON field, state that there is nothing there */
"There is no content to parse." = "No hay contenido que analizar.";

/* The prompt to tell the user they are about to overwrite the files in the existing application */
"This operation will overwrite files in this directory. Are you sure you want to continue?" = "Ya existe un archivo o un directorio con este nombre en el destino. Al reemplazar, se sobrescribirá el contenido.";

/* In the main screen, this is the verify button that formats the JSON */
"Verify" = "Verificar";

/* Success message in an action sheet */
"Your files have successfully been generated." = "Los archivos se han generado satisfactoriamente.";

/* In the save portion, for objective C, determine whether or not to use ARC */
"Use Automatic Reference Counting" = "Usar el recuento automático de referencias";

/* "The letters to prepend to the file */
"Class Prefix" = "Prefijo de número de archivo";

/*************** HTTP OPTIONS WINDOW STRINGS *************/

/* Title for the Method box in the HTTP Options window */
"Method" = "Método";

/* Title for the Headers box in the HTTP Options window */
"Headers" = "Cabecera";

/* Title for the field to enter a HTTP header key */
/* Title for the column of HTTP header keys */
"Key" = "Clave";

/* Title for the field to enter a HTTP header value */
/* Title for the column of HTTP header values */
"Value" = "Valor";

/* Title for the Add header button in the HTTP Options window */
"Add" = "Añadir";







